#include "bh1750.h"


uint8_t BUF[2],display[20];
uint16_t Lx_value = 0;
/**************************************************************
*功  能：发送设备地址
*参  数: 无
*返回值: 无 
**************************************************************/
void Cmd_Write_BH1750(uint8_t cmd)
{

	
	
	 IIC_Master_Transmit(&hiic2,BH1750_Addr, &cmd, 1);
	delay_1ms(5);
}


/**************************************************************
*功  能：开启一次H分辨率模式
*参  数: 无
*返回值: 无 
**************************************************************/
void Start_BH1750(void)
{
	Cmd_Write_BH1750(BH1750_ON);	 		//power on
	Cmd_Write_BH1750(BH1750_RSET);		//clear
	Cmd_Write_BH1750(BH1750_ONE);  		//一次H分辨率模式，至少120ms，之后自动断电模式  
}

/**************************************************************
*功  能：读光照信号
*参  数: 无
*返回值: 无 
**************************************************************/
void Read_BH1750(void)
{

	IIC_Master_Receive(&hiic2,BH1750_Addr+1, BUF, 2);
	delay_1ms(5);
}

/**************************************************************
*功  能：合成光照数据
*参  数: 无
*返回值: 无 
**************************************************************/
void Convert_BH1750(void)
{
	Lx_value=BUF[0];
	Lx_value=(Lx_value<<8)+BUF[1];		//合成数据，即光照数据
	Lx_value=(double)Lx_value/1.2;
}



uint16_t BH1750_Read(void)
{	
	Start_BH1750();						//power on
	delay_1ms(120);						//延时120ms
	Read_BH1750();						//连续读取结果 到BUF里面  
	Convert_BH1750();					//转换结果到result_lx
	return Lx_value;

}





