/**
************************************************************************
 *    文件名：android（安卓部分）
 *      说明：安卓与主车之间的通信
************************************************************************
**/
#include "android.h"

Typedef_Android Android_Data = 
{
	.Android_Main_Car_Start_Flag = 0, //主车开始启动标志位
	.Red_State = 0,         // 识别为红灯
	.Yellow_State = 0,      // 识别为黄灯         
	.Green_State = 0,      // 识别为绿灯
	.Two_Code_State = 0,   //识别二维码
	.TFT_Licence_Flag = 0,    // TFT车牌识别
	.TFT_Traffic_Flag = 0,    // TFT交通标志识别 
	.Control_TFT_Paging = 0,        //安卓回传控制TFT向下翻页
	.TFT_GraphCount_Flag = 0, //TFT图形数量识别
	.TFT_GraphColour_Flag = 0, //TFT图形颜色识别
	.TFT_Graph_CountAndColour_Flag = 0, //TFT图形识别(数量+颜色)
	.TFT_Mask_Flag = 0,  //TFT口罩识别    
	.TFT_Words_Flag = 0, //TFT文字识别  
	.xMainCar_Send_Android = &xMainCar_Send_Android,
    
    
    .TFT_CheXin_erro_Flag =0, //车型识别失败
    .TFT_CheXin_sucess_flag=0,
    .TFT_ChePai_sucess_flag=0,
};

uint8_t Two_Code_Data_Store[7] = {0};   //存储识别二维码后得到的数据
uint8_t TFT_License_Data_Store[6] = {0}; //TFT车牌数据存储
uint8_t TFT_Traffic_Data_Store[7] = {0}; //TFT交通标志数据存储
uint8_t TFT_GraphCount_Data_Store[7] = {0}; //TFT图形数量数据存储
uint8_t TFT_GraphColour_Data_Store[7] = {0}; //TFT图形颜色数据存储
uint8_t TFT_GraphAndColour_Data_Store[7] = {0}; //TFT图形(数量+颜色)数据存储
uint8_t TFT_Mask_Data_Store[7] = {0}; //TFT口罩行人数量
uint8_t TFT_Words_Data_Store[7] = {0}; //TFT文字识别存储数据



uint8_t Identify_Traffic_Light[8] = {0x55,0xFF,0x01,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别红绿灯
uint8_t Identify_Two_Code_Arr[8] = {0x55,0xFF,0x02,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别二维码
uint8_t Identify_TFT_License_Arr[8] = {0x55,0xFF,0x03,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别TFT车牌
uint8_t Identify_TFT_Traffic_Arr[8] = {0x55,0xFF,0x04,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别TFT交通标志
uint8_t Identify_TFT_GraphCount_Arr[8] = {0x55,0xFF,0x05,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别TFT图形数量
uint8_t Identify_TFT_GraphColour_Arr[8] = {0x55,0xFF,0x06,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别TFT图形颜色
uint8_t Identify_TFT_Graph_CountAndColour_Arr[8] = {0x55,0xFF,0x07,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别TFT图形（数量+颜色）
uint8_t Identify_TFT_Mask_Arr[8] = {0x55,0xFF,0x08,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别TFT口罩行人
uint8_t Identify_TFT_Words_Arr[8] = {0x55,0xFF,0x09,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别TFT文字识别

uint8_t Identify_TFT_CheXin_Arr[8] = {0x55,0xFF,0x11,0x00,0x00,0x00,0x00,0xBB};//主车发给安卓请求识别车型
/* 
【终端发送给主车的格式】
帧头第一位--0x55 帧头第二位--0xEE   帧头第三位判断哪个识别哪个任务
帧头第二位：用来判断是由安卓发送给主车，再由主车来处理，还是直接由安卓发送数据给主车给zigbee直接发送出去给标志物
操作码--0xXX 
校验和                                                  
帧尾--0xBB
*/

/*
【终端回传给主车的命令】

校验码 = (帧头3 + 数据1 + 数据2 + 数据3 + 数据4 + 数据5 + 数据6) % 256;

| 帧头3| 数据1 | 数据2| 数据3| 数据4 | 数据5| 数据6 | 校验码 | 帧尾 |
----------------------------------------------------------------------------------------------------------------
| 0xA0 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |  0x00 | 0xBB |主车启动(Android_Data.Android_Main_Car_Start_Flag = 1)
----------------------------------------------------------------------------------------------------------------
| 0x01 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |红绿灯识别成功,分别红黄绿的标志位置为1
----------------------------------------------------------------------------------------------------------------
| 0x02 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |识别并保存好二维码数据后，
----------------------------------------------------------------------------------------------------------------
| 0x03 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |识别TFT车牌成功 Android_Data.Android_TFT_Licence_Flag = 1;
----------------------------------------------------------------------------------------------------------------
| 0x04 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |识别TFT交通标志成功 Android_Data.Android_TFT_Traffic_Flag = 1;
----------------------------------------------------------------------------------------------------------------
| 0x05 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |安卓控制主车，从而让TFT向下翻页
----------------------------------------------------------------------------------------------------------------
| 0x06 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |TFT图形数量识别成功
----------------------------------------------------------------------------------------------------------------
| 0x07 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |TFT图形颜色识别成功
----------------------------------------------------------------------------------------------------------------
| 0x08 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |TFT图形识别成功（图形数量和颜色一起的数据）
----------------------------------------------------------------------------------------------------------------
| 0x09 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |TFT口罩数量识别成功
----------------------------------------------------------------------------------------------------------------
| 0x10 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |       | 0xBB |TFT文字识别成功

*/


/*   安卓回传给主车红绿灯数据

| 帧头3| 数据1 | 数据2| 数据3| 数据4 | 数据5| 数据6 | 校验码 | 帧尾 |
---------------------------------------------------------------------------------------------------------------
| 0x01 | 0x01 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |  0x00 | 0xBB |红灯
---------------------------------------------------------------------------------------------------------------
| 0x01 | 0x02 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |  0x00 | 0xBB |黄灯
---------------------------------------------------------------------------------------------------------------
| 0x01 | 0x03 | 0x00 | 0x00 | 0x00 | 0x00 | 0x00  |  0x00 | 0xBB |绿灯
*/




/*帧头第一位--0x55 帧头第二位--0xFF
主指令--0xXX
校验和 0x00 
帧尾--0xBB
*/
/*
【主车发送的命令】
--------------------------------------------------------------------------------
| 主指令  | 副指令[1]  | 副指令[2]  | 副指令[3] |			说明
|--------|-----------|-----------|-----------|-----------------------------------
| 0x01   |	 0x00	 |   0x00    | 0x00      | 请求识别交通灯
|--------|---------- |-----------|-----------|-----------------------------------
| 0x02   |	 0x00	 |   0x00    | 0x00      | 请求识别二维码
|--------|---------- |-----------|-----------|-----------------------------------
| 0x03   |   0x00    |	 0x00    | 0x00      | 请求识别TFT车牌 （只要绿色车牌）
|--------|---------- |-----------|-----------|-----------------------------------
| 0x04   |   0x00    |	 0x00    | 0x00      | 请求识别TFT交通标志
|--------|---------- |-----------|-----------|-----------------------------------
| 0x05   |   0x00    |	 0x00    | 0x00      | 请求识别TFT图形数量识别
|--------|---------- |-----------|-----------|-----------------------------------
| 0x06   |   0x00    |	 0x00    | 0x00      | 请求识别TFT图形颜色识别
|--------|---------- |-----------|-----------|-----------------------------------
| 0x07   |   0x00    |	 0x00    | 0x00      | 请求识别TFT图形识别（数量+颜色）
|--------|---------- |-----------|-----------|-----------------------------------
| 0x08   |   0x00    |	 0x00    | 0x00      | 请求识别TFT口罩行人
|--------|---------- |-----------|-----------|-----------------------------------
| 0x09   |   0x00    |	 0x00    | 0x00      |备用
|--------|---------- |-----------|-----------|-----------------------------------
| 0x0A   |   0x00    |	 0x00    | 0x00      |备用
|--------|---------- |-----------|-----------|-----------------------------------
| 0x0B   |   0x00    |	 0x00    | 0x00      |备用
|--------|---------- |-----------|-----------|-----------------------------------
| 0x0C   |   0x00    |	 0x00    | 0x00      |备用
|--------|---------- |-----------|-----------|-----------------------------------
| 0x0D   |   0x00    |	 0x00    | 0x00      |备用
|--------|---------- |-----------|-----------|-----------------------------------
| 0x0E   |   0x00    |	 0x00    | 0x00      |备用
|--------|---------- |-----------|-----------|-----------------------------------
| 0x0F   |   0x00    |	 0x00    | 0x00      |备用
|--------|---------- |-----------|-----------|-----------------------------------
| 0x10   |   0x00    |	 0x00    | 0x00      |备用
--------------------------------------------------------------------------------
*/



// 主车发送给安卓终端命令
void xMainCar_Send_Android(uint8_t* Cmd)
{
	uint8_t CheckSum;
	CheckSum = Mixture_Data.xGet_CheckSum(Cmd[2], Cmd[3], Cmd[4], Cmd[5]);
	Cmd[6] = CheckSum;
	Send_WifiData_To_Fifo(Cmd, 8);
	delay_ms(100);
}



//   红绿灯识别，  二维码识别， TFT车牌， TFT形状， TFT交通标志，  TFT翻页，











































